In [1]:
import pandas as pd

In [4]:
scores = [['Mathematics', 85 ], ['English', 91 ], ['History', 95 ]]
my_df = pd.DataFrame(scores, columns = ['Subject', 'Score'])
my_df

       Subject  Score
0  Mathematics     85
1      English     91
2      History     95

In [5]:
scores = {'Subject':["Mathematics", "History", "English", "Science", "Arts"],'Score':[ 98 , 75 , 68 , 82 , 99 ]}
my_df = pd.DataFrame(scores)
my_df

       Subject  Score
0  Mathematics     98
1      History     75
2      English     68
3      Science     82
4         Arts     99

In [7]:
scores = [
            {'Subject':'Mathematics', 'Score': 85 },
            {'Subject':'History', 'Score': 98 },
            {'Subject':'English', 'Score': 76 }, 
            {'Subject':'Science', 'Score': 72 },
            {'Subject':'Arts', 'Score': 95 }
        ]
my_df = pd.DataFrame(scores)
my_df

       Subject  Score
0  Mathematics     85
1      History     98
2      English     76
3      Science     72
4         Arts     95

In [8]:
my_df.head()

       Subject  Score
0  Mathematics     85
1      History     98
2      English     76
3      Science     72
4         Arts     95

In [9]:
my_df.tail(2)

   Subject  Score
3  Science     72
4     Arts     95

In [10]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Subject  5 non-null      object
 1   Score    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [11]:
my_df.describe()

           Score
count   5.000000
mean   85.200000
std    11.388591
min    72.000000
25%    76.000000
50%    85.000000
75%    95.000000
max    98.000000